package kk.kktools.shu.data;

import java.io.Serializable;

public class ShuXiangQingBean implements Serializable {
    /**
     * status : 1
     * info : success
     * data : {"id":563905,"name":"大梦主","cid":3017470,"cname":"序章","pid":-1,"nid":3017471,"content":"\r\n　　云雾缭绕的巍峨殿堂内，数十丈长的青色玉阶尽头处，一名金袍男子，笔直坐在一张洁白如玉的巨大椅子上。\r\n　　金碧辉煌的大殿内，此刻一片狼藉！\r\n　　地面上不但丢弃着众多斧钺钩叉等残破兵器，还有各种奇珍异宝洒落得到处都是，两侧巨大蟠龙柱更有数根碎裂，只剩下半截的柱墩。\r\n　　宏伟威严的殿堂死寂无声，除了金袍男子一人独自坐在那里外，再无任何其他人影。\r\n　　金袍男子对这一切视若无睹，只是木然地看着不远处地面上一物。\r\n　　一块残缺近半的巨大牌匾上，\u201c凌霄\u201d两个硕大金字散发着无尽威严气息。\r\n　　\u201c轰\u201d的一声巨响！\r\n　　巨殿微微一颤后，角落各处浮现出密密麻麻银色灵纹，飞快蔓延开来，一层又一层，越来越多，片刻间就仿佛巨大丝网一般遍布整座大殿。\r\n　　外面巨响打雷般地连绵不断，殿内银色灵纹狂闪不已，同时地面开裂，殿顶发出\u201c嘎吱\u201d的哀鸣之音。\r\n　　\u201c终于到了这一刻！\u201d\r\n　　金袍男子终于抬起头，喃喃了一句，望向大殿顶部，脸庞上隐约有一层白光覆盖，根本无法看清面容分毫。\r\n　　大殿紫金色的顶部，\u201c砰\u201d的崩裂碎开，在无数碎物飞舞中，一只山岳般大小的擎天魔手冲金袍男子恶狠狠抓下。\r\n　　\u2026\u2026\r\n　　一座万余丈高的金灿灿巨山，被一望无际的绿色魔焰包裹着，从巨山上顶部的寺庙中不停传出阵阵梵音佛唱之声，同时有无数金色梵文飞舞而出，拼命抵挡着附近魔焰的靠近。\r\n　　但随着时间流逝，从巨山中飞出的梵文越来越少，传出的梵音佛唱之声也渐渐低落下去，不久后被滚滚绿焰淹没，再无任何声响了。\r\n　　\u2026\u2026\r\n　　昏沉沉的幽冥鬼地中，黑色狰狞巨城的大门处，无数奇形怪状鬼物怪叫着狂涌而出，更有一些厉鬼或驾驭怪风飞行，或钻入地下直接遁行，仿佛泄洪的滔滔水，密密麻麻消失在外面的灰色荒野中。\r\n　　\u2026\u2026\r\n　　人间！正午！\r\n　　天空漆黑如墨，一丝阳光不见，无论城市还是荒野都仿若深夜般，只有点点灯火隐约可见。\r\n　　在一些城市乡镇地方，在灯火中，隐约可见无数人群仰首望着黑色天空，或目瞪口呆，或惶恐异常。\r\n　　漆黑天空中突然传来阵阵的低鸣，并且越来越响，越来越尖，仿若有无数人在低低哭泣一般，让人听之悲伤无比，泫然泪下。\r\n　　几乎同一时间，高空中闪动起密密麻麻的红光，随之一颗颗赤红陨石洞穿黑幕而出，大的仿若山岳，小的也足有房屋大小，轰隆隆地向人间坠落而下，遍布四洲之地。\r\n　　大唐年间，有魔物吞天，天泣之，降天火于世间，百姓死伤惨重。\u2014\u2014《魔劫录》\r\n　　\f\t\n","hasContent":1}
     */

    public int status;
    public String info;
    public DataBean data;

    public static class DataBean {
        /**
         * id : 563905
         * name : 大梦主
         * cid : 3017470
         * cname : 序章
         * pid : -1
         * nid : 3017471
         * content :
         　　云雾缭绕的巍峨殿堂内，数十丈长的青色玉阶尽头处，一名金袍男子，笔直坐在一张洁白如玉的巨大椅子上。
         　　金碧辉煌的大殿内，此刻一片狼藉！
         　　地面上不但丢弃着众多斧钺钩叉等残破兵器，还有各种奇珍异宝洒落得到处都是，两侧巨大蟠龙柱更有数根碎裂，只剩下半截的柱墩。
         　　宏伟威严的殿堂死寂无声，除了金袍男子一人独自坐在那里外，再无任何其他人影。
         　　金袍男子对这一切视若无睹，只是木然地看着不远处地面上一物。
         　　一块残缺近半的巨大牌匾上，“凌霄”两个硕大金字散发着无尽威严气息。
         　　“轰”的一声巨响！
         　　巨殿微微一颤后，角落各处浮现出密密麻麻银色灵纹，飞快蔓延开来，一层又一层，越来越多，片刻间就仿佛巨大丝网一般遍布整座大殿。
         　　外面巨响打雷般地连绵不断，殿内银色灵纹狂闪不已，同时地面开裂，殿顶发出“嘎吱”的哀鸣之音。
         　　“终于到了这一刻！”
         　　金袍男子终于抬起头，喃喃了一句，望向大殿顶部，脸庞上隐约有一层白光覆盖，根本无法看清面容分毫。
         　　大殿紫金色的顶部，“砰”的崩裂碎开，在无数碎物飞舞中，一只山岳般大小的擎天魔手冲金袍男子恶狠狠抓下。
         　　……
         　　一座万余丈高的金灿灿巨山，被一望无际的绿色魔焰包裹着，从巨山上顶部的寺庙中不停传出阵阵梵音佛唱之声，同时有无数金色梵文飞舞而出，拼命抵挡着附近魔焰的靠近。
         　　但随着时间流逝，从巨山中飞出的梵文越来越少，传出的梵音佛唱之声也渐渐低落下去，不久后被滚滚绿焰淹没，再无任何声响了。
         　　……
         　　昏沉沉的幽冥鬼地中，黑色狰狞巨城的大门处，无数奇形怪状鬼物怪叫着狂涌而出，更有一些厉鬼或驾驭怪风飞行，或钻入地下直接遁行，仿佛泄洪的滔滔水，密密麻麻消失在外面的灰色荒野中。
         　　……
         　　人间！正午！
         　　天空漆黑如墨，一丝阳光不见，无论城市还是荒野都仿若深夜般，只有点点灯火隐约可见。
         　　在一些城市乡镇地方，在灯火中，隐约可见无数人群仰首望着黑色天空，或目瞪口呆，或惶恐异常。
         　　漆黑天空中突然传来阵阵的低鸣，并且越来越响，越来越尖，仿若有无数人在低低哭泣一般，让人听之悲伤无比，泫然泪下。
         　　几乎同一时间，高空中闪动起密密麻麻的红光，随之一颗颗赤红陨石洞穿黑幕而出，大的仿若山岳，小的也足有房屋大小，轰隆隆地向人间坠落而下，遍布四洲之地。
         　　大唐年间，有魔物吞天，天泣之，降天火于世间，百姓死伤惨重。——《魔劫录》
         * hasContent : 1
         */

        public int id;
        public String name;
        public int cid;
        public String cname;
        public int pid;
        public int nid;
        public String content;
        public int hasContent;
    }
}
